tutorials/counterFlowFlame2D/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    // model           unityLewisFourier;
    model           MaxwellStefanFourier;
    mixtureDiffusionCoefficients no;
    D
    {
        #include        "binaryDiffusionCoefficientsPolynomialDict"
    }
}


// ************************************************************************* //
